Repository: mbuesch/awlsim
Catalog: awlsim/locales/*/LC_MESSAGES/*.po
Languages: ru, uk

source: Establishing SSH tunnel...
ru: Создание туннеля SSH...
uk: Встановлення SSH тунелю ...

source: Failed to establish SSH tunnel
ru: Не удалось создать SSH туннель
uk: Не вдалося встановити SSH тунель

source: Failed to establish SSH tunnel: {}
ru: Не удалось создать SSH туннель: {}
uk: Не вдалося встановити SSH тунель: {}

source: Please enter SSH password
ru: Введите пароль SSH
uk: Введіть пароль SSH

source: Please enter SSH password for '{}@{}':
ru: Введите пароль SSH для '{}@{}':
uk: Введіть пароль SSH для '{}@{}':

source: Confirm host authenticity?
ru: Подтвердить подлинность хоста?
uk: Підтвердити автентичність хоста?

source: Sources
ru: Исходники
uk: Першокод

source: Symbols
ru: Символы
uk: Символи

source: Libraries
ru: Библиотеки
uk: Бібліотеки

source: Blocks
ru: Блоки
uk: Блоки

source: OBs
ru: OB-и

source: FCs
ru: FC-и

source: FBs
ru: FB-и

source: DBs
ru: DB-и

source: UDTs
ru: UDT-и

source: Hardware
ru: Оборудование
uk: Обладнання

source: Main cycle: "CYCL_EXC"
ru: Основной цикл: "CYCL_EXC"
uk: Основний цикл: "CYCL_EXC"

source: Warm start: "COMPLETE RESTART"
ru: Теплый старт: "COMPLETE RESTART"
uk: Теплий старт: "COMPLETE RESTART"

source: Restart: "RESTART"
ru: Перезапуск: "RESTART"
uk: Перезапуск: "RESTART"

source: Cold restart: "COLD RESTART"
ru: Холодный перезапуск: "COLD RESTART"
uk: Холодний перезапуск: "COLD RESTART"

source: Source files
ru: Исходные файлы
uk: Першокоди

source: AWL/STL sources
ru: AWL/STL исходники
uk: AWL/STL першокод

source: FUP/FBD sources
ru: FUP/FBD исходники
uk: FUP/FBD першокод

source: Symbol table sources
ru: Исходники таблиц символов
uk: Першокод таблиці символів

source: Library selections
ru: Выбор библиотеки
uk: Вибір бібліотеки

source: Compiled blocks
ru: Скомпилированные блоки
uk: Скомпільовані блоки

source: Organization Blocks
ru: Организационные блоки
uk: Організаційні блоки

source: Functions
ru: Функции
uk: Функції

source: Function Blocks
ru: Функционные блоки
uk: Функціональні блоки

source: Data Blocks
ru: Блоки данных
uk: Блоки даних

source: User defined Data Types
ru: Пользовательские типы данных
uk: Обрані типи даних

source: Hardware modules
ru: Модули оборудования
uk: Модулі обладнання

source: Block name
ru: Имя блока
uk: Ім'я блоку

source: Symbol / description
ru: Символ / описание
uk: Символ / опис

source: Unique identification hash
ru: Уникальный хэш идентификации
uk: Унікальний ідентифікаційний хеш

source: &Remove block from CPU...
ru: &Удалить блок из ЦП...
uk: &Видалити блок з ЦП...

source: &Remove source from CPU...
ru: &Удалить исходный код из ЦП...
uk: &Видалити першокод з ЦП...

source: Remove selected source?
ru: Удалить выбранный исходник?
uk: Видалити обраний першокод?

source: Remove the selected source from the CPU? This will also remove all associated compiled blocks from the CPU.
ru: Удалить выбранный исходник из ЦП? Это также удалит все связанные блоки из ЦП.
uk: Видалити обраний першокод?n Також буде видалено усі зв'язані скомпільовані блоки з ЦП.

source: An error occurred while removing a source
ru: Произошла ошибка при удалении исходника
uk: Сталася помилка під час видалення першокоду

source: Remove selected block?
ru: Удалить выбранный блок?
uk: Видалити обраний блок?

source: Remove the selected block from the CPU?
ru: Удалить выбранный блок из ЦП?
uk: Видалити обраний блок з ЦП?

source: An error occurred while removing a block
ru: Произошла ошибка при удалении блока
uk: Сталася помилка під час видалення блоку з ЦП

source: &Accept
ru: &Принять
uk: &Прийняти

source: &Cancel
ru: &Отмена
uk: &Скасувати

source: Hardware resource specification
ru: Спецификация оборудования
uk: Специфікація апаратних ресурсів

source: Number of accumulator registers
ru: Количество регистров аккумуляторов
uk: Кількість регістрів-акумуляторів

source: Select the number of ACCU registers the CPU will have. Note that this selection influences the semantics of some arithmetic instructions such as +I,-I,*I,/I and others.
ru: Выберите количество регистров ACCU, которое будет иметь ЦП. Обратите внимание, что этот выбор влияет на семантику некоторых арифметических инструкций, таких как +I,-I,*I,/I и другие.
uk: Введіть кількість ACCU регістрів у ЦП. Будьте уважні, цей вибір впливає на семантику деяких арифметичних інструкцій, наприклад +I,-I,*I,/I та інші.

source: 2 accus
ru: 2 акк.
uk: 2 ак.

source: 4 accus
ru: 4 акк.
uk: 4 ак.

source: Number of S7 timers
ru: Количество таймеров S7
uk: Кількість S7 таймерів

source: Set the number of S7 timers the CPU will have. This does only influence the number of S7 timers. There will always be an unlimited amount of IEC timers.
ru: Установите количество таймеров S7, которые будет иметь ЦП. Это влияет только на количество таймеров S7. Всегда будет неограниченное количество таймеров IEC.
uk: Введіть кількість таймерів S7 у ЦП. Цей вибір впливає тільки на кількість таймерів S7. Кількість IEC таймерів необмежена.

source: Number of S7 counters
ru: Количество счетчиков S7
uk: Кількість лічильників S7

source: Set the number of S7 counters the CPU will have. This does only influence the number of S7 counters. There will always be an unlimited amount of IEC counters.
ru: Установите количество счетчиков S7, которое будет иметь ЦП. Это влияет только на количество счетчиков S7. Всегда будет неограниченное количество счётчиков IEC.
uk: Введіть кількість лічильників S7 у ЦП. Цей вибір впливає тільки на кількість лічильників S7. Кількість IEC лічильників необмежена.

source: Number flag (Merker) memory bytes
ru: Количество байт памяти флагов (Merker)
uk: Кількість сигнальних (Merker) байтів пам'яті

source: Set the number flag (Merker) memory bytes the CPU will have.
ru: Установите количество байт памяти флагов (Merker), которые будет иметь ЦП.
uk: Введіть кількість сигнальних (Merker) байтів пам'яті у ЦП.

source: Number process image input bytes
ru: Количество входных байтов процесса
uk: Кількість оброблюваних вхідних байтів

source: Set the number process image input memory bytes the CPU will have.
ru: Установите количество входных байтов памяти, которые будет иметь ЦП.
uk: Введіть кількість оброблюваних вхідних байтів у ЦП.

source: Number process image output bytes
ru: Количество выходных байтов процесса
uk: Кількість оброблюваних вихідних байтів

source: Set the number process image output memory bytes the CPU will have.
ru: Установите количество выходных байтов памяти, которые будет иметь ЦП.
uk: Введіть кількість оброблюваних вихідних байтів у ЦП.

source: Number local stack memory (TEMP) bytes
ru: Количество байт локальной памяти стека (TEMP)
uk: Кількість байтів (TEMP) пам'яті локального стеку

source: Set the number local stack memory (TEMP) bytes the CPU will have per organization block invocation.
ru: Установка количества байт локальной памяти стека (TEMP), которые ЦП будет иметь для каждого вызова блока организации.
uk: Вкажіть кількість байтів (TEMP) пам'яті локального стеку, що матиме ЦП на кожен виклик організаційного блоку.

source: Parenthesis stack (Klammerstack) size
ru: Размер родительского стека (Klammerstack)
uk: Розмір вкладеного стеку (Klammerstack)

source: Set the depth of the parenthesis stack (Klammerstack) the CPU will have per block invocation.
ru: Установите глубину родительского стека (Klammerstack), которую ЦП будет иметь на каждый блок вызова.
uk: Введіть глибину вкладеного стеку (Klammerstack), що матиме ЦП на виклик блоку.

source: CALL stack size
ru: Размер стека CALL
uk: Розмір стеку CALL

source: Set the depth of the CALL stack. This is the number of nested CALLs that can be made per OB invocation.
ru: Установите глубину стека CALL. Это количество вложенных вызовов, которое может быть сделано за вызов OB.
uk: Введіть глибину стеку CALL. Ця цифра означає кількість вкладених викликів, яку можливо здійснити на один виклик ОВ.

source: Hardware configuration
ru: Конфигурация оборудования
uk: Конфігурація обладнання

source: Clock memory byte (Taktmerker)
ru: Память часов (Taktmerker)
uk: Байт пам'яті годинника (Taktmerker)

source: Select an M byte for use as clock memory byte (Taktmerker).
ru: Выберите M байт для использования в качестве байта памяти часов (Taktmerker).
uk: Виберіть М-байт для використання як байт пам'яті годинника (Taktmerker).

source: Enable writing of OB &TEMP entry-variables
ru: Включить запись переменных OB и TEMP
uk: Увімкнути редагування OB &TEMP вхідних змінних

source: If this box is not checked the entry variables in the ORGANIZATION_BLOCK's TEMP region will not be filled by the system on entry into the OB.
ru: Если этот флажок не отмечен, то переменные в зоне ORGANIZATION_BLOCK's TEMP не будут заполнены системой при входе в OB.
uk: Якщо цей прапорець не увімкнений, то вхідні змінні у ORGANIZATION_BLOCK пам'яті TEMP не заповняться при вході системи в OB.

source: Cycle (OB 1) time limit
ru: Ограничение времени (OB 1)
uk: Ліміт часу циклу (OB 1)

source: Time limit of one cycle (OB 1) run, in milliseconds. The CPU goes into exceptional state (STOP), if the cycle time limit is exceeded.
ru: Ограничение времени одного цикла (OB 1) в миллисекундах. ЦП переходит в состояние остановки (STOP), если лимит времени цикла превышен.
uk: Ліміт часу одного запуску циклу (OB 1) в мілісекундах. ЦП перейде до стану СТОП, якщо ліміт часу буде вичерпано.

source: Cycle (OB 1) time minimum
ru: Минимальное время (OB 1)
uk: Мінімальний час циклу (OB 1)

source: Cycle time minimum target of one cycle (OB 1) run, in milliseconds. If this value is bigger than zero, then the CPU increases the cycle time to approximately this value. It does so by sleeping at the end of the cycle (OB 1). This decreases power consumption. But it also increases the OB 1 latency to the specified time. If the actual cycle time needed for calculations is bigger than this value, no sleep will happen. A value in the region of 10 ms is recommended.
ru: Минимальное целевое время цикла одного цикла (OB 1) в миллисекундах. Если это значение больше нуля, то ЦП увеличивает время цикла примерно до этого значения. Это делается путем засыпания ЦП в конце цикла (OB 1). Это снижает энергопотребление. Но это также увеличивает задержку OB 1 до указанного времени. Если фактическое время цикла, необходимое для расчетов, больше чем это значение, засыпание не произойдет. Рекомендуется значение в области 10 мс.
uk: Мінімальний час виконання одного запуску циклу (OB 1) в мілісекундах. Якщо цей параметр не дорівнює нулю, тоді ЦП збільшує час виконання циклу до приблизно такого значення. Затримка виконується пропуском тактів після виконання циклу (OB 1). Цей параметр знижує споживання потужності, але також збільшує затримку циклу OB 1 на визначений час. Якщо актуальний час виконання більший за цей параметр, тоді затримка не відбувається. Рекомендоване значення приблизно 10мс.

source: AWL language
ru: Язык AWL
uk: Мова AWL

source: Mnemonics language
ru: Язык мнемоники
uk: Мова мнемонік

source: Select the AWL/STL mnemonics type. This may be either German or International (English). Automatic will try to guess the mnemonics from the AWL/STL code. Note that this might fail, though.
ru: Выберите тип мнемоники AWL/STL. Это может быть немецкая или международная (на английская). Автоматика может попробовать угадать мнемонику из кода AWL/STL. Однако, заметьте, что это может привести к сбою.
uk: Вкажіть тип мнемонік AWL/STL. Це може бути Німецька, або Інтернаціональна (Англійська). Мнемоніка може бути вгадана автоматично з першокоду AWL/STL Зауважте, що це може призвести до помилки.

source: Automatic
ru: Автоматически
uk: Автоматично

source: English
ru: Английская
uk: Англійська

source: German
ru: Немецкая
uk: Німецька

source: Enable e&xtended non-standard instructions
ru: Включить н&естандартные инструкции
uk: Увімкнути р&озширені не стандартні інструкції

source: Enable special Awlsim specific AWL/STL instructions that are not available in the standard S7 language. Enabling this option is harmless even if such instructions are not used.
ru: Включить специальные инструкции Awlsim для AWL/STL, которые не доступны в стандартном языке S7. Включение этой опции является безвредным, даже, если такие инструкции не используются.
uk: Увімкнути спеціальні інструкції Awlsim, для мови AWL/STL, які недоступні у стандартній мові S7. Увімкнення цього параметру безпечне, навіть якщо інструкції не використовуються.

source: Program
ru: Программа
uk: Програма

source: Enable pre-download program validation
ru: Включить предзагрузочную проверку программы
uk: Увімкнути перевірку перед завантаженням

source: Validate program before downloading it to the CPU. This may catch certain program errors before download.
ru: Проверить программу перед загрузкой на ЦП. Это может помочь найти некоторые ошибки в программе перед загрузкой.
uk: Перевірка програми попереду завантаження її у ЦП. Допоможе перехопити певні програмні помилки перед завантаженням.

source: CPU setup
ru: Настройка ЦП
uk: Налаштування ЦП

source: Failed to write to memory
ru: Не удалось записать в память
uk: Не вдалося записати у пам'ять

source: CPU overview
ru: Обзор ЦП
uk: Огляд ЦП

source: No CPU status available. Please put the CPU into RUN mode.
ru: Статус ЦП недоступен. Пожалуйста, переведите ЦП в режим РАБОТА.
uk: Стан ЦП недоступний. Переведіть ЦП у режим ДІЇ.

source: Inputs
ru: Входа
uk: Входи

source: Outputs
ru: Выхода
uk: Виходи

source: Flags
ru: Флаги
uk: Сигнали

source: Data block
ru: Блок данных
uk: Блок даних

source: invalid address
ru: недопустимый адрес
uk: помилковий адрес

source: Not DWORD
ru: Не DWORD
uk: Не DWORD

source: Checkboxes
ru: Флажки
uk: Прапорці

source: Dual
ru: Двойной
uk: Подвійний

source: Decimal
ru: Десятичный
uk: Десятковий

source: Hexadecimal
ru: Шестнадцатиричный
uk: Шістнадцятковий

source: Real
ru: Вещественный
uk: Дійсний

source: Invalid State_Mem config string.
ru: Недопустимая строка конфигурации State_Mem.
uk: Недійсний рядок State_Mem у конфігурації.

source: Signed BCD
ru: Знаковый BCD
uk: Знаковий BCD

source: Binary
ru: Двоичный
uk: Двійковий

source: Signed binary
ru: Знаковый двоичный
uk: Знаковий двійковий

source: Cannot parse State_LCD config string.
ru: Не удалось пропарсить строку State_LCD.
uk: Не вдалося проаналізувати рядок конфігурації State_LCD.

source: Invalid State_LCD config string.
ru: Неправильная строка конфигурации State_LCD.
uk: Неправильний рядок конфігурації State_LCD.

source: Invalid State_TimerCounter config string.
ru: Неправильная строка конфигурации State_TimerCounter.
uk: Неправильний рядок конфігурації State_TimerCounter.

source: Timer
ru: Таймер
uk: Таймер

source: Counter
ru: Счетчик
uk: Лічильник

source: BCD (counter)
ru: BCD (счетчик)
uk: BCD (лічильник)

source: CPU online content (downloaded blocks)
ru: Содержимое ЦП (загруженные блоки)
uk: Наявний склад ЦП (завантажені блоки)

source: Unknown CPU state window type {}.
ru: Неизвестный тип окна состояния ЦП {}.
uk: Невідомий тип вікна стану ЦП {}.

source: Error in awlsim core
ru: Ошибка awlsim ядра
uk: Помилка в ядрі awlsim

source: Shut down application?
ru: Закрыть приложение?
uk: Закрити застосунок?

source: The core server requested an application shutdown. Do you want to close Awlsim GUI?
ru: Основной сервер запросил выключение приложения. Вы хотите закрыть Awlsim GUI?
uk: Основний сервер вимагає відключення застосунку. Ви хочете закрити графічний інтерфейс Awlsim?

source: Shutting down, as requested by server...
ru: Завершение работы по запросу сервера...
uk: Закривання застосунку, з вимоги сервера ...

source: Unknown maintenance request {}
ru: Неизвестный запрос на обслуживание {}
uk: Невідомий запит обслуговування {}

source: Could not start CPU
ru: Не удалось запустить ЦП
uk: Не вдалося запустити ЦП

source: Core server error
ru: Ошибка основного сервера
uk: Помилка основного сервера

source: Could not stop CPU
ru: Не удалось остановить ЦП
uk: Не вдалося зупинити ЦП

source: Error while trying to connect to CPU
ru: Ошибка при попытке соединения с ЦП
uk: Помилка під час з'єднання з ЦП

source: Error while trying to disconnect from CPU
ru: Ошибка при попытке отключения от ЦП
uk: Помилка під час від'єднання від ЦП

source: Validating project before downloading...
ru: Проверка проекта перед загрузкой...
uk: Перевірка проекту перед завантаженням...

source: Project validation failed. Loading anyway...
ru: Проверка проекта не удалась. Загрузка в любом случае...
uk: Проект не пройшов перевірку. Все одно завантажуємо...

source: Pre-download validation of the project failed. Continuing the download may bring the CPU to STOP. Do you want to continue or cancel downloading the project to the CPU?
ru: Не удалось выполнить проверку проекта перед загрузкой. Дальнейшая загрузка может привести остановке ЦП. Вы хотите продолжить или отменить загрузку проекта на ЦП?
uk: Проект не пройшов перевірку перед завантаженням. Продовження завантаження може призвести до ЗУПИНКИ ЦП. Ви бажаєте продовжити чи відмінити завантаження до ЦП?

source: Error while loading code
ru: Ошибка при загрузке кода
uk: Помилка під час завантаження коду

source: No source selected.
ru: Исходник не выбран.
uk: Першокод не обран.

source: Cannot download a single source. No source has been opened in the edit area.
ru: Не удается загрузить отдельный исходник. В области редактирования не было открыто ни одного исходника.
uk: Не вдалося завантажити окремий першокод. Жодного файлу не відкрито у робочій зоні.

source: Single AWL download: {}/{}
ru: Отдельная загрузка AWL: {}/{}
uk: Завантаження окремого AWL: {}/{}

source: Single FUP download: {}/{}
ru: Отдельная загрузка FUP: {}/{}
uk: Завантаження окремого FUP: {}/{}

source: Single KOP download: {}/{}
ru: Отдельная загрузка KOP: {}/{}
uk: Завантаження окремого KOP: {}/{}

source: Single sym download: {}/{}
ru: Отдельная загрузка SYM: {}/{}
uk: Завантаження окремого SYM: {}/{}

source: Single libSelections download.
ru: Загрузка отдельной libSelect.
uk: Завантаження окремої бібліотеки.

source: Error while loading code (single source)
ru: Ошибка при загрузке кода (один исходник)
uk: Помилка під час завантаження коду (окремий першокод)

source: Error while reseting CPU
ru: Ошибка при сбросе ЦП
uk: Помилка під час перезапуску ЦП

source: Failed to setup instruction dumping
ru: Не удалось настроить дамп инструкций
uk: Не вдалося встановити вивантаження інструкцій

source: Failed to refresh project
ru: Не удалось обновить проект
uk: Не вдалося оновити проект

source: Failed to refresh project data. Not closing the editor window to avoid loss of data.
ru: Не удалось обновить данные проекта. Не закрывайте окно редактора, чтобы избежать потери данных.
uk: Не вдалося оновити дані проекту. Не закривайте вікно редактору щоб уникнути втрати даних.

source: (DISABLED)
ru: (ЗАБЛОКИРОВАННО)
uk: (ЗАБЛОКОВАНО)

source: Import AWL/STL source
ru: Импорт исходника AWL/STL
uk: Імпорт першокоду AWL/STL

source: AWL source (*.awl);;All files (*)
ru: Исходный код AWL (*.awl);;Все файлы (*)
uk: AWL першокод (*.awl);;Усі файли (*)

source: AWL/STL source export
ru: Экспорт AWL/STL исходника
uk: Експорт першокоду AWL/STL

source: AWL/STL source file (*.awl)
ru: Исходник AWL/STL (*.awl)
uk: AWL/STL файли першокоду (*.awl)

source: Import FUP/FBD XML source
ru: Импорт исходника FUP/FBD
uk: Імпорт першокоду FUP/FBD XML

source: FUP/FBD XML source (*.fupxml);;All files (*)
ru: Исходник XML-код FUP/FBD (*.fupxml);;Все файлы (*)
uk: FUP/FBD XML першокод (*.fupxml);;Усі файли (*)

source: fup/fbd xml source export
ru: Экспорт fup/fbd xml исходника
uk: Експорт першокоду FUP/FBD

source: fup/fbd xml source file (*.fupxml)
ru: fup/fbd исходный файл xml (*.fupxml)
uk: FUP/FBD XML файли першокоду (*.fupxml)

source: Failed to export source
ru: Не удалось экспортировать исходник
uk: Не вдалося експортувати першокод

source: (Symbol-table)
ru: (Символьная таблица)
uk: (Таблиця символів)

source: Import symbol table
ru: Импорт таблицы символов
uk: Імпорт таблиці символів

source: Symbol table file (*.asc);;All files (*)
ru: Файл таблицы символов (*.asc);;Все файлы (*)
uk: Файл таблиці символів (*.asc);;Усі файли (*)

source: symbol table export
ru: Экспорт таблицы символов
uk: Експорт таблиці символів

source: symbol table file (*.asc)
ru: файл таблицы символов (*.asc)
uk: Файл таблиці символів (*.asc)

source: Online items
ru: Элементы онлайн
uk: Наявні елементи

source: Status bit: /FC (/ER)
ru: Бит статуса: /FC (/ER)
uk: Біт статусу: /FC (/ER)

source: Status bit: RLO (VKE)
ru: Бит статуса: RLO (VKE)
uk: Біт статусу: RLO (VKE)

source: Status bit: STA
ru: Бит статуса: STA
uk: Біт статусу: STA

source: Status bit: OR
ru: Бит статуса: OR
uk: Біт статусу: OR

source: Status bit: OS
ru: Бит статуса: OS
uk: Біт статусу: OS

source: Status bit: OV
ru: Бит статуса: OV
uk: Біт статусу: OV

source: Status bit: CC0 (A0)
ru: Бит статуса: CC0 (A0)
uk: Біт статусу: CC0 (A0)

source: Status bit: CC1 (A1)
ru: Бит статуса: CC1 (A1)
uk: Біт статусу: CC1 (A1)

source: Status bit: BR (BIE)
ru: Бит статуса: BR (BIE)
uk: Біт статусу: BR (BIE)

source: Full status word
ru: Полное слово статуса
uk: Повний статус

source: DB register
ru: DB регистр
uk: Регістр DB

source: DI register
ru: DI регистр
uk: Регістр DI

source: Please enter your AWL program here... Did you know
ru: Пожалуйста, введите здесь вашу программу AWL... Знаете ли вы
uk: Будь ласка введіть вашу AWL програму тут... А Ви знали

source: The AWL/STL code contains non-{}-characters. These were ignored and stripped from the code.
ru: Код AWL/STL содержит не-{}-символы. Они были проигнорированы и удалены из кода.
uk: Першокод AWL/STL містить не-{}-символи. Вони були проігноровані та вирізані з коду.

source: OFFLINE
ru: ОФЛАЙН
uk: НЕМАЄ З'ЄДНАННЯ

source: Online (CPU stopped)
ru: Онлайн (ЦП остановлен)
uk: Є з'єднання (ЦП зупинено)

source: DOWNLOADING program. Please wait.
ru: ЗАГРУЗКА программы. Пожалуйста, подождите.
uk: ЗАВАНТАЖЕННЯ програми. Будь ласка зачекайте.

source: ERROR. CPU halted.
ru: ОШИБКА. ЦП остановлен.
uk: ПОМИЛКА. ЦП зупинено.

source: Find:
ru: Найти:
uk: Знайти:

source: Regular &expression
ru: Регулярное &выражение
uk: Регулярні &вираження

source: Replace with:
ru: Заменить на:
uk: Замінити цим:

source: From &cursor
ru: От &курсора
uk: Від &курсору

source: &Up
ru: &Вверх
uk: &Вгору

source: &Down
ru: &Вниз
uk: &Донизу

source: Case &sensitive
ru: Учитывать &регистр
uk: Залежно від &регістру

source: &Whole words only
ru: &Только слова целиком
uk: &Тільки цілі слова

source: &Replace
ru: &Заменить
uk: &Замінити

source: Replace &all
ru: Заменить &все
uk: Закрити &всі

source: C&lose
ru: З&акрыть
uk: З&ачинити

source: Find and replace text
ru: Найти и заменить текст
uk: Знайти та замінити текст

source: Find text
ru: Найти текст
uk: Знайти текст

source: Reached end of document. Text not found.
ru: Достигнут конец документа. Текст не найден.
uk: Досягнуто кінця документа. Текст не знайдено.

source: 1 occurrence replaced.
ru: 1 вхождение заменено.
uk: Замінено 1 входження.

source: {} occurrences replaced.
ru: {} вхождений заменено.
uk: Замінено {} входжень.

source: &Find next
ru: &Найти далее
uk: &Знайти наступний

source: &Find
ru: &Найти
uk: &Знайти

source: Invalid <connection> pos.
ru: Неправильная поз. <connection>.
uk: Неправильна позиція <connection> .

source: Invalid <connection>
ru: Неправильное <connection>
uk: Неправильне <connection>

source: <element> connections are incomplete.
ru: <element> не все соединено.
uk: <element> має не всі з'єднання.

source: Arithmetic subtype '{}' is not known to the element parser.
ru: Подтип арифметики '{}' не известен парсеру элементов.
uk: Арифметичний підтип '{}' невідомий аналізатору елементів .

source: <element> caused a grid collision.
ru: <element> вызвал коллизии в таблице.
uk: <element> спричинив суперечності у сітці.
