Repository: mbuesch/awlsim
Catalog: awlsim/locales/*/LC_MESSAGES/*.po
Languages: ru, uk

source: Boolean subtype '{}' is not known to the element parser.
ru: Двоичный подтип '{}' не известен парсеру элементов.
uk: Двійковий підтип '{}' невідомий аналізатору елементів .

source: Found multiple <subelements> tags inside of boolean <element>.
ru: Найдено несколько <subelements> тегов внутри двоичного <element>.
uk: Знайдено декілька тегів <subelements> у двійковому <element>.

source: Exactly one subelement of type 'embedded operand' is required in boolean <element>.
ru: Только один подэлемент типа 'встроенный операнд' требуется в логическом <element>.
uk: Тільки один субелемент типу 'вбудований операнд' потребується двійковим <element>.

source: <subelements> is not supported for {}.
ru: <subelements> не поддерживается для {}.
uk: <subelements> не підтримуються {}.

source: Compare subtype '{}' is not known to the element parser.
ru: Подтип сравнения '{}' не известен парсеру элементов.
uk: Порівняльний підтип'{}' невідомий аналізатору елементів .

source: Change comment
ru: Изменить комментарий
uk: Змінити коментар

source: Comment
ru: Комментарий
uk: Коментар

source: Conversion subtype '{}' is not known to the element parser.
ru: Подтип преобразования '{}' не известен парсеру элементов.
uk: Перетворюючий підтип'{}' невідомий аналізатору елементів .

source: Counter subtype '{}' is not known to the element parser.
ru: Подтип счетчика '{}' не известен парсеру элементов.
uk: Лічильний підтип '{}' невідомий аналізатору елементів .

source: Found multiple <subelements> tags inside of counter <element>.
ru: Найдено несколько <subelements> тегов внутри счетчика <element>.
uk: Знайдено декілька тегів <subelements>у лічильному <element>.

source: Exactly one subelement of type 'embedded operand' is required in counter <element>.
ru: Точно один подэлемент типа 'встроенный операнд' требуется в счётчике <element>.
uk: Тільки один субелемент типу 'вбудований операнд' потребується лічильним <element>.

source: Operand subtype '{}' is not known to the element parser.
ru: Подтип операнда '{}' не известен парсеру элементов.
uk: Підтип операнда '{}' невідомий аналізатору елементів .

source: Shift subtype '{}' is not known to the element parser.
ru: Подтип сдвига '{}' не известен парсеру элементов.
uk: Зсувний підтип '{}' невідомий аналізатору елементів .

source: Add LOB (Last shifted Out Bit) output
ru: Добавить выход LOB (выход последнего сдвига)
uk: Додати вихід LOB (останній змінений біт)

source: Timer subtype '{}' is not known to the element parser.
ru: Подтип таймера '{}' не известен парсеру элементов.
uk: Таймерний підтип '{}' невідомий аналізатору елементів .

source: Found multiple <subelements> tags inside of timer <element>.
ru: Найдено несколько <subelements> тегов внутри таймера <element>.
uk: Знайдено декілька тегів <subelements> у таймері <element>.

source: Exactly one subelement of type 'embedded operand' is required in timer <element>.
ru: Точно один подэлемент типа 'встроенный операнд' требуется в таймере <element>.
uk: Тільки один субелемент типу 'вбудований операнд' потребується таймером <element>.

source: FUP element {} duplicate UUID. Generating new UUID.
ru: Элемент FUP {} дублирует UUID. Создается новый UUID.
uk: FUP елемент {} має дубльований UUID. Створюється новий UUID.

source: <wire id={}> does already exist.
ru: <wire id={}> уже существует.
uk: <wire id={}> вже існує.

source: &Edit element...
ru: &Изменить элемент...
uk: &Правка елементу...

source: &Copy element(s)...
ru: &Копировать элемент(ы)...
uk: &Скопіювати елемент(и)...

source: C&ut element(s)...
ru: В&ырезать элемент(ы)...
uk: В&ирізати елемент(и)...

source: &Paste element(s)...
ru: &Вставить элемент(ы)...
uk: &Вставити елемент(и)...

source: &Remove element
ru: &Удалить элемент
uk: &Видалити елемент

source: E&nable element
ru: В&ключить элемент
uk: У&вімкнути елемент

source: &Disable element
ru: &Отключить элемент
uk: &Вимкнути елемент

source: In&vert connection
ru: Ин&вертировать соединение
uk: Ін&вертувати з'єднання

source: Add input &connection
ru: Добавить &входное подключение
uk: Додати вхідне &з'єднання

source: Add &output connection
ru: Добавить &выходное подключение
uk: Додати &вихідне з'єднання

source: Remove &connection
ru: Удалить &соединение
uk: Видалити &з'єднання

source: &Disconnect wire
ru: &Отсоединить провод
uk: &Від'єднати дріт

source: __mimeDataToGrid: Failed to parse MIME data: {}
ru: __mimeDataToGrid: Не удалось разобрать данные MIME: {}
uk: __mimeDataToGrid: Невдалося проаналізувати дані MIME: {}

source: __mimeDataToGrid: Failed to relocate elements.
ru: __mimeDataToGrid: Не удалось переместить элементы.
uk: __mimeDataToGrid: Невдалося перемістити елементи.

source: Unexpected exception in FupDrawWidget.dragEnterEvent(): {} {}
ru: Непредвиденное исключение в FupDrawWidget.dragEnterEvent(): {} {}
uk: Неочікувана помилка в FupDrawWidget.dragEnterEvent(): {} {}

source: Unexpected exception in FupDrawWidget.dragLeaveEvent(): {} {}
ru: Непредвиденное исключение в FupDrawWidget.dragLeaveEvent(): {} {
uk: Неочікувана помилка в FupDrawWidget.dragLeaveEvent(): {} {}

source: Unexpected exception in FupDrawWidget.dragMoveEvent(): {} {}
ru: Непредвиденное исключение в FupDrawWidget.dragMoveEvent(): {} {}
uk: Неочікувана помилка в FupDrawWidget.dragMoveEvent(): {} {}

source: Unexpected exception in FupDrawWidget.dropEvent(): {} {}
ru: Непредвиденное исключение в FupDrawWidget.dropEvent(): {} {
uk: Неочікувана помилка в FupDrawWidget.dropEvent(): {} {}

source: Paste of FUP grid failed
ru: Не удалось вставить сетку FUP
uk: Не вдалося вставити FUP сітку

source: The FUP grid cannot be pasted here, because elements collide. Please select another position in the grid.
ru: Сетка FUP не может быть вставлена здесь, так как элементы конфликтуют. Пожалуйста, выберите другую позицию в сетке.
uk: Сітку FUP тут не можна вставити, оскільки стикаються елементи. Виберіть інше місце в сітці.

source: [...] Comment
ru: [...] Комментарий
uk: [...] Коментар

source: Boolean
ru: Двоичный
uk: Двійкові

source: [&] and
ru: [&] и
uk: [&] і

source: [>=1] or
ru: [>=1] или
uk: [>=1] або

source: [X] xor
ru: [X] искл. или
uk: [X] виключне або

source: [S] set
ru: [S] установить
uk: [S] встановити

source: [R] reset
ru: [R] сброс
uk: [R] скинути

source: [SR] SR flip-flop
ru: [SR] SR тригер
uk: [SR] SR тригер

source: [RS] RS flip-flop
ru: [RS] RS тригер
uk: [RS] RS тригер

source: [FP] positive edge
ru: [FP] восходящий фронт
uk: [FP] висхідний фронт

source: [FN] negative edge
ru: [FN] спадающий фронт
uk: [FN] спадний фронт

source: Counters
ru: Счетчики
uk: Лічильники

source: [CUD] Counter
ru: [CUD] Счетчик
uk: [CUD] Лічильник

source: [CU] Counter up
ru: [CU] Счетчик вверх
uk: [CU] Лічильник вгору

source: [CUo] Counter up-only
ru: [CUo] Счетчик только вверх
uk: [CUo] Ліч. тільки-вгору

source: [CD] Counter down
ru: [CD] Счетчик вниз
uk: [CD] Лічильник вниз

source: [CDo] Counter down-only
ru: [CDo] Счетчик только вниз
uk: [CDo] Ліч. тільки-вниз

source: [CSo] Counter set
ru: [CSo] Счетчик установлен
uk: [CSo] Ліч. встановити

source: Timers
ru: Таймеры
uk: Таймери

source: [SP] Pulse
ru: [SP] Импульс
uk: [SP] Імпульс

source: [SE] Extended pulse
ru: [SE] Увеличенный импульс
uk: [SE] Довгий імпульс

source: [SD] On-delay
ru: [SD] Задержка вкл.
uk: [SD] Затримка увімкнення

source: [SS] Extended on-delay
ru: [SS] Увелич. задержка вкл.
uk: [SS] Довга затр. увімкнення

source: [SF] Off-delay
ru: [SF] Задержка выкл.
uk: [SF] Затримка вимкнення

source: Move / convert
ru: Переместить / преобразовать
uk: Рух / перетворення

source: [L] load
ru: [L] загрузка
uk: [L] завантаженя

source: [=] assign
ru: [=] присвоить
uk: [=] присвоєння

source: -[=]- move box
ru: -[=]- перемещение
uk: -[=]- переміщення

source: [I->D] INT to DINT
ru: [I->D] INT в DINT
uk: [I->D] INT до DINT

source: [neg I] negate INT
ru: [neg I] отрицательный INT
uk: [neg I] інв. знак INT

source: [neg D] negate DINT
ru: [neg D] отрицательный DINT
uk: [neg D] інв. знак DINT

source: [inv I] bitwise invert INT
ru: [inv I] побитное инверт. INT
uk: [inv I] порозрядна інв. INT

source: [inv D] bitwise invert DINT
ru: [inv D] побитное инверт. DINT
uk: [inv D] порозрядна інв. DINT

source: [D->R] DINT to REAL
ru: [D->R] DINT в REAL
uk: [D->R] DINT до REAL

source: [neg R] negate REAL
ru: [neg R] отрицательный REAL
uk: [neg R] інв. знак REAL

source: [round] round REAL
ru: [round] округлить REAL
uk: [round] округлити REAL

source: [trunc] truncate REAL
ru: [trunc] усечь REAL
uk: [trunc] усікти REAL

source: [round+] round REAL to pos.
ru: [round+] округл. REAL до поз.
uk: [round+] округл. REAL до поз.

source: [round-] round REAL to neg.
ru: [round-] округл. REAL до нег.
uk: [round-] округл. REAL до нег.

source: [BCD->I] BCD to INT
ru: [BCD->I] BCD в INT
uk: [BCD->I] BCD до INT

source: [BCD->D] BCD to DINT
ru: [BCD->D] BCD в DINT
uk: [BCD->D] BCD до DINT

source: [I->BCD] INT to BCD
ru: [I->BCD] INT в BCD
uk: [I->BCD] INT до BCD

source: [D->BCD] DINT to BCD
ru: [D->BCD] DINT в BCD
uk: [D->BCD] DINT до BCD

source: Byte order
ru: Порядок байтов
uk: Порядок байтів

source: [swap W] swap WORD order
ru: [swap W] обмен байт WORD
uk: [swap W] змін. WORD місцями

source: [swap D] swap DWORD order
ru: [swap D] обмен байт DWORD
uk: [swap D] змін. DWORD місцями

source: [+I] INT addition
ru: [+I] INT добавление
uk: [+I] INT додавання

source: [-I] INT subtraction
ru: [-I] INT вычитание
uk: [-I] INT віднімання

source: [*I] INT multiplication
ru: [*I] INT умножение
uk: [*I] INT множення

source: [/I] INT division
ru: [/I] INT деление
uk: [/I] INT ділення

source: [+D] DINT addition
ru: [+D] DINT добавление
uk: [+D] DINT додавання

source: [-D] DINT subtraction
ru: [-D] DINT вычитание
uk: [-D] DINT віднімання

source: [*D] DINT multiplication
ru: [*D] DINT умножение
uk: [*D] DINT множення

source: [/D] DINT division
ru: [/D] DINT деление
uk: [/D] DINT ділення

source: [MOD] DINT modulo
ru: [MOD] DINT модуль
uk: [MOD] DINT модуль

source: [+R] REAL addition
ru: [+R] REAL добавление
uk: [+R] REAL додавання

source: [-R] REAL subtraction
ru: [-R] REAL вычитание
uk: [-R] REAL віднімання

source: [*R] REAL multiplication
ru: [*R] REAL умножение
uk: [*R] REAL множення

source: [/R] REAL division
ru: [/R] REAL деление
uk: [/R] REAL ділення

source: [SSI >>] Signed INT right shift
ru: [SSI >>>] Знак. INT сдвиг вправо
uk: [SSI >>] Знак. INT зсув вправо

source: [SRW >>] WORD right shift
ru: [SRW >>] WORD сдвиг вправо
uk: [SRW >>] WORD зсув вправо

source: [SLW <<] WORD left shift
ru: [SLW <<] WORD сдвиг влево
uk: [SLW <<] WORD зсув вліво

source: [SSD >>] Signed DINT right shift
ru: [SSD >>>] Знак. DINT сдвиг вправо
uk: [SSD >>] Знак. DINT зсув вправо

source: [SRD >>] DWORD right shift
ru: [SRD >>] DWORD сдвиг вправо
uk: [SRD >>] DWORD зсув вправо

source: [SLD <<] DWORD left shift
ru: [SLD <<] DWORD сдвиг влево
uk: [SLD <<] DWORD зсув вліво

source: [RLD <<] DWORD rotate left
ru: [RLD <<] DWORD оборот влево
uk: [RLD <<] DWORD поверн. вліво

source: [RRD <<] DWORD rotate right
ru: [RRD <<] DWORD оборот вправо
uk: [RRD <<] DWORD поверн. вправо

source: [==I] INT equal
ru: [==I] INT равен
uk: [==I] INT рівний

source: [<>I] INT not equal
ru: [<>I] INT не равен
uk: [<>I] INT не рівний

source: [>I] INT greater than
ru: [>I] INT больше
uk: [>I] INT більший

source: [<I] INT less than
ru: [<I] INT меньше
uk: [<I] INT менший

source: [>=I] INT greater or equal
ru: [>=I] INT больше или равно
uk: [>=I] INT більший чи рівний

source: [<=I] INT less or equal
ru: [<=I] ИНТ меньше или равно
uk: [<=I] INT менший чи рівний

source: [==D] DINT equal
ru: [==D] DINT равен
uk: [==D] DINT рівний

source: [<>D] DINT not equal
ru: [<>D] DINT не равен
uk: [<>D] DINT не рівний

source: [>D] DINT greater than
ru: [>D] DINT больше
uk: [>D] DINT білший

source: [<D] DINT less than
ru: [<D] DINT меньше
uk: [<D] DINT менший

source: [>=D] DINT greater or equal
ru: [>=D] DINT больше или равно
uk: [>=D] DINT більший чи рівний

source: [<=D] DINT less or equal
ru: [<=D] DINT меньше или равно
uk: [<=D] DINT менший чи рівний

source: [==R] REAL equal
ru: [==R] REAL равен
uk: [==R] REAL рівний

source: [<>R] REAL not equal
ru: [<>R] REAL не равен
uk: [<>R] REAL не рівний

source: [>R] REAL greater than
ru: [>R] REAL больше
uk: [>R] REAL більший

source: [<R] REAL less than
ru: [<R] REAL меньше
uk: [<R] REAL менший

source: [>=R] REAL greater or equal
ru: [>=R] REAL больше или равно
uk: [>=R] REAL більший чи рівний

source: [<=R] REAL less or equal
ru: [<=R] REAL меньше или равно
uk: [<=R] REAL менший чи рівний

source: [AWL] Inline AWL code
ru: [AWL] Встроенный код AWL
uk: [AWL] Вбудований код AWL

source: Arithmetic
ru: Арифметика
uk: Арифметика

source: Shift
ru: Сдвиг
uk: Зсув

source: Compare
ru: Сравнение
uk: Порівняння

source: Unsupported FUP version. Got {}, but expected {}.
ru: Неподдерживаемая версия FUP. {}, но ожидалось {}.
uk: Непідтримувана версія FUP. Отримали {}, але очікували {}.

source: Awlsim FUP/FBD source generated by awlsim-{}
ru: Awlsim FUP/FBD исходник созданный awlsim-{}
uk: Awlsim FUP/FBD першокод сгенерований awlsim-{}

source: Configure &optimizer...
ru: Настроить &оптимизатор...
uk: Налаштувати &оптимізатор...

source: Show AWL code (DE, optimized)...
ru: Показать AWL код (DE, оптимизировано)...
uk: Показати код AWL (DE, оптимізований)...

source: Show AWL code (DE)...
ru: Показать AWL код (DE)...
uk: Показати код AWL (DE)...

source: Show STL code (EN, optimized)...
ru: Показать STL код (EN, оптимизировано)...
uk: Показати код STL (EN, оптимізований)...

source: Show STL code (EN)...
ru: Показать STL код (EN)...
uk: Показати код STL (EN)...

source: Generate CALL template...
ru: Создать шаблон CALL...
uk: Створити зразок CALL ...

source: FUP/FBD compiler...
ru: FUP/FBD компилятор...
uk: FUP/FBD компілятор...

source: Failed to create FUP source: {}
ru: Не удалось создать исходный код FUP: {}
uk: Не вдалося створити першокод FUP: {}

source: Composed FUP XML:
ru: Составленный FUP XML:
uk: Складений FUP XML:

source: Parsing FUP XML:
ru: Парсинг FUP XML:
uk: Аналіз FUP XML:

source: Failed to parse FUP source: {}
ru: Не удалось разобрать исходный код FUP: {}
uk: Не вдалося проаналізувати першокод FUP: {}

source: FUP compiler error
ru: Ошибка компилятора FUP
uk: Помилка компілятора FUP

source: FUP/FBD CALL template - {}
ru: Шаблон FUP/FBD CALL - {}
uk: Зразок FUP/FBD CALL - {}

source: Compiled FUP/FBD diagram - {}
ru: Скомпилированная диаграмма FUP/FBD - {}
uk: Скомпільована діаграма FUP/FBD - {}

source: FUP diagram change
ru: Изменение диаграммы FUP
uk: FUP правка діаграми

source: Failed to {} a FUP/FBD change
ru: Не удалось {} FUP/FBD изменения
uk: Не вдалося {} FUP/FBD правку

source: Source code editor
ru: Редактор исходного кода
uk: Редактор першокоду

source: &Auto indentation
ru: &Авто отступ
uk: &Автоматичний відступ

source: Automatically indent AWL/STL code as it is entered into the editor area.
ru: Автоматически делать отступы AWL/STL кода, когда он вводится в область редактора.
uk: Автоматичний відступ коду AWL/STL після його введення в область редактора.

source: Clipboard &paste auto indentation
ru: Авто отступ для &вставки из буфера
uk: Відступ для &вставки з буферу

source: Automatically indent AWL/STL code as it is pasted into the editor area.
ru: Автоматически делать отступы AWL/STL кода при вставке его в область редактора.
uk: Автоматично робити відступ коду AWL/STL під час вставки в область редактора.

source: Live code &validation
ru: &Проверка кода в фоновом режиме
uk: Поточна &перевірка коду

source: Enable automatic compilation and verification of the AWL/STL code as it is entered into the editor. The verification completely runs in the background.
ru: Включить автоматическую компиляцию и проверку AWL/STL кода, когда он вводится в редактор. Проверка полностью работает в фоновом режиме.
uk: Увімкнути автоматичну компіляцію та перевірку AWL/STL коду, коли він вводиться в редактор. Перевірка повністю працює у фоновому режимі.

source: Select the AWL/STL editor font.
ru: Выберите шрифт редактора AWL/STL.
uk: Виберіть шрифт редактора AWL/STL.

source: &Select...
ru: &Выбрать...
uk: &Обрати...

source: Font: {}, {} pt
ru: Шрифт: {}, {} пт
uk: Шрифт: {}, {} пт

source: Editor font
ru: Шрифт редактора
uk: Шрифт редактора

source: User interface setup
ru: Настройка интерфейса
uk: Налаштування інтерфейсу користувача

source: Hardware parameters [{}]: Replacing parameter '{}' with fully compatible parameter '{}'.
ru: Параметры оборудования [{}]: Замена параметра '{}' полностью совместимым параметром '{}'.
uk: Параметри обладнання [{}]: Заміна параметру '{}' на повністю відповідний параметр'{}'.

source: {} Default value: {}
ru: {} Значение по умолчанию: {}
uk: {} Як усталено {}

source: The parameter's name
ru: Имя параметра
uk: Ім'я параметру

source: New parameter name
ru: Имя нового параметра
uk: Нове ім'я параметру

source: Parameter
ru: Параметр
uk: Параметр

source: Value
ru: Значение
uk: Значення

source: new
ru: новый
uk: новий

source: Available modules:
ru: Доступные модули:
uk: Наявні модулі:

source: Name of another module to add. Note: Typos in the module name will result in errors on CPU startup.
ru: Имя модуля для добавления. Примечание: Опечатка в имени модуля приведет к ошибке при запуске ЦП.
uk: Ім'я іншого модуля, який потрібно додати. Примітка: помилки в назві модуля призведуть до помилок при запуску ЦП.

source: Add the selected module to the project and mark it for download to the CPU.
ru: Добавить выбранный модуль в проект и отметить его для загрузки на ЦП.
uk: Додати обраний модуль до проекту і позначити його для завантаження в процесор.

source: Remove the selected module from the project and mark it for removal from the CPU.
ru: Удалить выбранный модуль из проекта и пометить его для удаления из ЦП.
uk: Видалити обраний модуль з проекту та позначити його для вилучення з процесора.

source: Loaded modules:
ru: Загруженные модули:
uk: Завантажені модулі:

source: Move the selected loaded module up. Modules are executed in order from top to bottom.
ru: Переместить выбранный загруженный модуль вверх. Модули выполняются по порядку сверху вниз.
uk: Перемістити обраний модуль вгору. Модулі виконуються у порядку від верху до низу.

source: Move the selected loaded module down. Modules are executed in order from top to bottom.
ru: Переместить выбранный загруженный модуль вниз. Модули выполняются по порядку сверху вниз.
uk: Перемістити обраний модуль нижче. Модулі виконуються у порядку від верху до низу.

source: Module parameters:
ru: Параметры модуля:
uk: Параметри модуля:

source: Hardware module setup
ru: Настройка аппаратного модуля
uk: Налаштування обладнання

source: Block type: Function (FC)
ru: Тип блока: Функция (FC)
uk: Тип блоку: Функція (FC)

source: Block type: Function block (FB)
ru: Тип блока: Функциональный блок (FB)
uk: Тип блоку: Функціональний блок (FB)

source: Block type: Organization block (OB)
ru: Тип блока: Организационный блок (OB)
uk: Тип блоку: Організаційний блок (OB)

source: Enter the block name here. This can be an absolute block name like FB 42 or FC 42 or OB 100 or a symbolic block name like "My function block" (The symbolic name must be present in the symbol table.)
ru: Введите имя блока. Это может быть абсолютное имя блока, как FB 42 или FC 42 или OB 100 или символьное имя блока, как "Мой блок функции" (Символьное имя должно присутствовать в таблице символов.)
uk: Введіть тут ім'я блоку. Це може бути абсолютна назва блоку FB 42 або FC 42 або OB 100 або символічна назва блоку, як "Мій функціональний блок" (Символічна назва повинна бути присутньою у таблиці символів.)

source: DIs:
ru: DI-и:
uk: DI-и:

source: Enter the instance DBs to create here. If this field is left empty, no DB will be generated. One DB or a comma separated list of DBs to create can be specified. For example: DB 42 or DB 42, DB 43, DB 44 or a symbolic block name like "First data block", "Second data block" (The symbolic name must be present in the symbol table.)
ru: Введите здесь имя DB для создания. Если это поле оставлено пустым, то база данных не будет создана. Можно указать одну DB или разделенный запятыми список DB для создания. Например: DB 42 или DB 42, DB 43, DB 44 или символьное имя блока, как "Первый блок данных", "Второй блок данных" (Символьное имя должно присутствовать в таблице символов.)
uk: Введіть назву DB, щоб створити тут. Якщо це поле залишити порожнім, жодна DB не буде створена. Можна задати одну DB або відокремлений комою список DB. Наприклад: DB 42 або DB 42, DB 43, DB 44 або символічна назва блоку, як "Перший блок даних", "Другий блок даних" (Символічна назва повинна бути присутньою у таблиці символів.)

source: Create a new INPUT field here...
ru: Создать новое поле INPUT...
uk: Створити нове поле INPUT тут...

source: Create a new OUTPUT field here...
ru: Создать новое поле OUTPUT...
uk: Створити нове поле OUTPUT тут...

source: Create a new IN_OUT field here...
ru: Создать новое поле IN_OUT...
uk: Створити нове поле IN_OUT тут...

source: Create a new STAT field here...
ru: Создать новое поле STAT...
uk: Створити нове поле STAT тут...

source: Create a new TEMP field here...
ru: Создать новое поле TEMP...
uk: Створити нове поле TEMP тут...

source: Function (FC) return value.
ru: Значение возврата функции (FC).
uk: Повернене значення функції (FC).

source: The interface field name.
ru: Имя интерфейса.
uk: Поле назви інтерфейсу.

source: The interface field data type. For example: BOOL or INT
ru: Тип данных интерфейса. Например: BOOL или INT
uk: Поле типу даних інтерфейсу. Наприклад: BOOL чи INT

source: The initial value in the associated DB.
ru: Начальное значение в связанной DB.
uk: Початкове значення в пов'язаній DB.

source: Interface field name
ru: Имя интерфейса
uk: Ім'я інтерфейсу

source: Data type
ru: Тип данных
uk: Тип даних

source: Init value
ru: Начальное значение
uk: Початкове значення

source: Change block type?
ru: Изменить тип блока?
uk: Змінити тип блоку?

source: The block interface table is not empty. Changing the block type might delete interface fields. Change block type anyway?
ru: Таблица интерфейса не пуста. Изменение типа блока может удалить поля интерфейса. Все равно изменить тип блока?
uk: Таблиця блоку інтерфейсу не порожня. Зміна типу блоку може видалити поля інтерфейсу. У будь-якому разі змінити тип блоку?

source: Paste library code body?
ru: Вставить код библиотеки?
uk: Вставити код тіла бібліотеки?

source: Warning: It is not recommended to paste library code into the project sources. You should instead just import the library (via library selection table) and CALL the imported function. See the 'CALL "{}"' or 'CALL {}' buttons. Do you want to paste the code nevertheless?
ru: Предупреждение: Не рекомендуется вставлять код библиотеки в исходники проекта. Вместо этого вы должны просто импортировать библиотеку (через выбор библиотеки) и вызвать (CALL) импортируемую функцию. Смотрите кнопки 'CALL "{}"' или 'CALL {}'. Вы хотите вставить код?
uk: Попередження: Не рекомендується вставляти код бібліотеки у першокод проекту. Натомість слід просто імпортувати бібліотеку (через таблицю вибору бібліотеки) та виконати CALL імпортованої функції. Дивіться кнопки 'CALL "{}"' або 'CALL {}'. Ви все ж хочете вставити код?

source: AWL/STL - Standard library
ru: AWL/STL - Стандартная библиотека
uk: AWL/STL - Стандартна бібліотека

source: System functions (SFC)
ru: Системные функции (SFC)
uk: Системні функції (SFC)

source: System function blocks (SFB)
ru: Блоки системных функций (SFB)
uk: Системні функц. блоки (SFB)

source: Library error
ru: Ошибка библиотеки
uk: Помилка бібліотеки

source: Library or block not found!
ru: Библиотека или блок не найдены!
uk: Не знайдені бібліотека або блок!
