Repository: mbuesch/awlsim
Catalog: awlsim/locales/*/LC_MESSAGES/*.po
Languages: ru, uk

source: The name of the library. (The name is case insensitive.)
ru: Имя библиотеки. (Имя без учета регистра)
uk: Назва бібліотеки (Назва не вразлива до регістру.)

source: The name of the block from the library to include. For example: FC 10 or FB 42
ru: Имя блока из библиотеки для включения. Например: FC 10 или FB 42
uk: Ім'я блоку для додаваня з бібліотеки. Наприклад: FC 10 or FB 42

source: The local name of the block. The block can be CALLed by this name from within the user program. For example: FC 110 or FB 142
ru: Локальное имя блока. Блок может быть вызван этим именем внутри пользовательской программы. Например: FC 110 или FB 142
uk: Місцеве ім'я блоку. Блок може бути викликаним(CALL) по цьому імені з програми користувача. Наприклад: FC 110 or FB 142

source: Library
ru: Библиотека
uk: Бібліотека

source: Library block
ru: Блок библиотеки
uk: Блок бібліотеки

source: Use as block
ru: Использовать как блок
uk: Вик. як блок

source: Description
ru: Описание
uk: Опис

source: Invalid block selection: {}
ru: Недопустимый выбор блока: {}
uk: Неправильний вибір блоку: {}

source: Effective block type does not match the library's block type '{}'.
ru: Этот тип блока не соответствует типу блока библиотеки '{}'.
uk: Наступний тип блоку не відповідає типу блоку з бібліотеки '{}'.

source: Invalid library information
ru: Некорректная информация о библиотеке
uk: Неправильна інформація про біблотеку

source: A semicolon (;) separated list of Python interpreters used to run the simulator core. The list is tried first to last element, until one working interpreter is found. The special value $CURRENT is the interpreter that is used to run the frontend. The special value $DEFAULT will expand to this list: {} ---> If you are unsure, leave this as $DEFAULT <---
ru: Разделенный точкой с запятой (;) список интерпретаторов Python для запуска ядра симулятора. Сначала попытается запустить с последнего элемента до тех пор, пока не будет найден один рабочий интерпретатор. Особое значение $CURRENT - это интерпретатор, используемый для запуска интерфейса. Особое значение $DEFAULT разворачивается в этот список: {} ---> Если вы не уверены, оставить это как $DEFAULT<---
uk: Список інтерпретаторів Python розділений точками з комою (;), що використовується для запуску ядра симулятора. Список виконується від початку до останнього елемента, поки не знайдеться один працюючий інтерпретатор. Змінна $CURRENT - це інтерпретатор, який використовується для запуску інтерфейсу. Змінна $DEFAULT розшириться до цього списку: {} ---> Якщо ви не впевнені, залиште це як $DEFAULT <---

source: Python interpreter list:
ru: Список интерпретаторов Python:
uk: Список інтерпретаторів Python:

source: Spawn the new simulator core server on any port within this range. ---> If you are unsure, do not change the defaults. <---
ru: Создать новый сервер симулятора на любом порту в этом диапазоне. ---> Если вы не уверены, не изменяйте значения по умолчанию. <---
uk: Створити новий основний сервер симулятора на будь-якому порту в межах цього діапазону. ---> Якщо ви не впевнені, не змінюйте значення за замовчуванням. <---

source: Port range:
ru: Диапазон портов:
uk: Діапазон портів:

source: from
ru: от
uk: від

source: to
ru: до
uk: до

source: The SSH login user name of the remote server.
ru: SSH имя пользователя для удаленного сервера.
uk: Ім'я користувача для входу в SSH віддаленого сервера.

source: SSH login user:
ru: SSH логин:
uk: Користувач SSH:

source: Port number of the remote SSH server. Leave this as {} unless you know what you are doing.
ru: Порт удаленного SSH сервера. Оставьте это как {}, если не знаете, что вы делаете.
uk: Номер порту віддаленого SSH сервера. Залиште це як {}, якщо ви не знаєте, що робите.

source: SSH port:
ru: Порт SSH:
uk: Порт SSH:

source: The local SSH client executable. This can be the full path to the SSH client program.
ru: Файл локального клиента SSH. Это может быть полный путь к клиентской программе SSH.
uk: Місцевий застосунок клієнта SSH. Це може бути повний шлях до клієнтського застосунку SSH.

source: Port number of the local tunnel end. It is recommended to use automatic port selection.
ru: Конечный порт локального туннеля. Рекомендуется использовать автоматический выбор портов.
uk: Номер порту місцевого тунелю. Рекомендується використовувати автоматичний вибір порту.

source: Local port:
ru: Локальный порт:
uk: Локальний порт:

source: auto
ru: авто
uk: авто

source: The host name or IP address of the core server to connect to.
ru: Имя хоста или IP-адрес основного сервера для подключения.
uk: Ім'я хоста або IP-адреса основного сервера, до якого потрібно підключитися.

source: Core server host:
ru: Хост основного сервера:
uk: Основний сервер:

source: The port number of the core server to connect to.
ru: Порт основного сервера для подключения.
uk: Номер порту основного сервера, до якого потрібно підключитися.

source: Core server port:
ru: Порт основного сервера:
uk: Порт сервера:

source: Connection timeout.
ru: Время ожидания соединения истекло.
uk: Час очікування з'єднання.

source: Timeout:
ru: Время ожидания:
uk: Ліміт часу:

source: Establish an SSH tunnel to the core server and connect via this tunnel. SSH is a secure and encrypted way to connect to a server.
ru: Установить SSH туннель к основному серверу и соединиться через этот туннель. SSH - это безопасный и зашифрованный способ подключения к серверу.
uk: Встановіть тунель SSH до основного сервера та підключіться через цей тунель. SSH - це безпечний і зашифрований спосіб підключення до сервера.

source: via SSH t&unnel
ru: через т&уннель SSH
uk: через SSH т&унель

source: Operation mode
ru: Режим работы
uk: Режим роботи

source: Start a &simulator core
ru: Запустить ядро &симулятора
uk: Запустити ядро &симулятора

source: This will start a simulator core on-the-fly in the background. ---> If you don't know what to do, select this. <---
ru: Это запустит ядро симулятора на в фоновом режиме. ---> Если вы не знаете, что делать, выберите это. <---
uk: Це запустить ядро ​​симулятора "на льоту" у фоновому режимі. ---> Якщо ви не знаєте, що робити, виберіть це. <---

source: Connect to an &external core
ru: Подключиться к &внешнему ядру
uk: Приєднатися до &зовнішнього ядра

source: Connect to an already running core server. This server may be running locally or somewhere else on the (trusted) network.
ru: Подключиться к уже запущенному основному серверу. Этот сервер может работать локально или где-нибудь в (доверенной) сети.
uk: Під'єднатися до вже запущеного основного сервера. Цей сервер може працювати локально або десь в мережі (довіреній).

source: Show advanced &options
ru: Показать &дополнительные опции
uk: Показати розширені &параметри

source: Show expert simulator core options. You should not normally need to change any of these. Changing them might break the execution of the simulator core.
ru: Показать дополнительные параметры симулятора. Вам обычно не нужно изменять ни один из них. Изменение их может нарушить выполнение ядра симулятора.
uk: Показати розширені параметри симулятора. Зазвичай вам не потрібно змінювати будь-які з них. Їх зміна може порушити роботу ядра симулятора.

source: Always as&k
ru: Всегда &спрашивать
uk: Завжди пи&тати

source: Always open this dialog when trying to connect to a CPU.
ru: Всегда открывать это окно при попытке подключиться к ЦП.
uk: Завжди відкривати це діалогове вікно при з'єднанні з ЦП.

source: Server connection setup
ru: Настройка соединения с сервером
uk: Налаштування з'єднання з сервером

source: Awlsim - Downloading...
ru: Awlsim - Загрузка...
uk: Awlsim - Завантаження...

source: Downloading project to CPU. Please be patient. This might take a few seconds.
ru: Загрузка проекта на ЦП. Пожалуйста, будьте терпеливы. Это может занять несколько секунд.
uk: Завантаження проекту до ЦП. Будьте терплячі. Це займе декілька секунд.

source: {}CPU view
ru: {}ЦП обзор
uk: {}Огляд ЦП

source: {}Project
ru: {}Проект
uk: {}Проект

source: Failed to find '{}'
ru: Не удалось найти '{}'
uk: Не вдалося знайти '{}'

source: Could not spawn a new instance. Failed to find '{}'
ru: Не удалось создать новый экземпляр. Не удалось найти '{}'
uk: Не вдалося створити новий екземпляр. Не вдалося знайти '{}'

source: Failed to execute '{}'
ru: Не удалось выполнить '{}'
uk: Не вдалося виконати '{}'

source: Could not spawn a new instance. {}Failed to execute '{}'
ru: Не удалось создать новый экземпляр. {}Не удалось выполнить '{}'
uk: Не вдалося створити новий екземпляр. {} Не вдалося виконати '{}'

source: Unsaved project
ru: Несохранённый проект
uk: Незбережений проект

source: The current project is modified and contains unsaved changes. Do you want to: - Save the project, close it and open the new project - Open the new project in a new instance or - Discard the changes and open the new project - Cancel the operation
ru: Текущий проект изменен и содержит несохраненные изменения. Вы хотите: - Сохранить проект, закрыть и открыть новый проект - Открыть новый проект в новом экземпляре или - Отменить изменения и открыть новый проект - Отменить операцию
uk: Поточний проект містить незбережені правки. Ви бажаєте: - Зберегти проект, закрити та відкрити новий - Відкрити новий проект в новому екземплярі чи - Скасувати зміни та відкрити новий проект - Скасувати операцію

source: Please select AWL/STL source
ru: Выберите исходник AWL/STL
uk: Виберіть першокод AWL/STL

source: Can not paste text. Please move the text cursor to the place in the AWL/STL code where you want to paste to.
ru: Невозможно вставить текст. Пожалуйста, переместите курсор на место в коде AWL/STL, куда вы хотите вставить.
uk: Не вдалось вставити текст. Встановіть курсор у місце AWL/STL коду, куди ви бажаєте вставити текст.

source: CPU: offline
ru: ЦП: оффлайн
uk: ЦП: немає з'єднання

source: CPU: online / STOP
ru: ЦП: онлайн / СТОП
uk: ЦП: є з'єднання / СТОП

source: CPU: loading
ru: ЦП: загрузка
uk: ЦП: завантаження

source: CPU: RUN
ru: ЦП: РАБОТА
uk: ЦП: ДІЯ

source: CPU: EXCEPTION
ru: ЦП: ОШИБКА
uk: ЦП: ПОМИЛКА

source: {} stmt/s ({} µs/stmt)
ru: {} ст/с ({} мкс/ст)
uk: {} оп/с ({} мкс/оп)

source: OB1: avg: {} ms min: {} ms max: {} ms padding: {} ms
ru: OB1: срд: {} мс мин: {} мс макс: {} мс пауза: {} мс
uk: OB1: срд: {} мс мін.: {} мс макс.: {} мс пауза: {} мс

source: Main tool bar
ru: Главная панель инструментов
uk: Головна панель інструментів

source: New project
ru: Новый проект
uk: Новий проект

source: Open project
ru: Открыть проект
uk: Відкрити проект

source: Save project
ru: Сохранить проект
uk: Зберегти проект

source: Undo last edit
ru: Отменить последнюю правку
uk: Скасувати останню правку

source: Redo
ru: Повтор
uk: Повторити

source: Cut
ru: Вырезать
uk: Вирізати

source: Copy
ru: Копировать
uk: Скопіювати

source: Paste
ru: Вставить
uk: Вставити

source: Find...
ru: Найти...
uk: Знайти...

source: Find and replace...
ru: Найти и заменить...
uk: Знайти та замінити...

source: Standard library
ru: Стандартная библиотека
uk: Стандартна бібліотека

source: Standard library. (Please click into the AWL/STL source code at the place where to paste the library call)
ru: Стандартная библиотека. (Пожалуйста, нажмите в исходный код AWL/STL на месте вставки библиотечного вызова)
uk: Стандартна бібліотека. (Встановіть курсор в місце AWL/STL коду де бажаєте зробити виклик бібліотеки)

source: &File
ru: &Файл
uk: &Файл

source: &New project
ru: &Новый проект
uk: &Новий проект

source: &Open project...
ru: &Открыть проект...
uk: &Відкрити проект...

source: &Save project
ru: &Сохранить проект
uk: &Зберегти проект

source: &Save project as...
ru: &Сохранить проект как...
uk: &Зберегти проект як...

source: &Exit...
ru: &Выход...
uk: &Вихід...

source: &Edit
ru: &Изменить
uk: &Правка

source: &Undo
ru: &Отмена
uk: &Скасувати

source: &Redo
ru: &Повтор
uk: &Повторити

source: &Cut
ru: &Вырезать
uk: &Вирізати

source: &Copy
ru: &Копировать
uk: &Скопіювати

source: &Paste
ru: &Вставить
uk: &Вставити

source: &Find...
ru: &Найти...
uk: &Знайти...

source: Find and r&eplace...
ru: Найти и з&аменить...
uk: Знайти та з&амінити...

source: &Library
ru: &Библиотека
uk: &Бібліотека

source: Insert &OB template...
ru: Вставить шаблон &OB...
uk: Вставити шаблон &OB ...

source: Insert F&C template...
ru: Вставить шаблон F&C...
uk: Вставити шаблон F&C ...

source: Insert F&B template...
ru: Вставить шаблон F&B...
uk: Вставити шаблон F&B ...

source: Insert &instance-DB template...
ru: Вставить шаблон &экземпляр-DB...
uk: Вставити шаблон &instance-DB ...

source: Insert &DB template...
ru: Вставить шаблон &DB...
uk: Вставити шаблон &DB ...

source: Insert &UDT template...
ru: Вставить шаблон &UDT...
uk: Вставити шаблон &UDT ...

source: Insert FC C&ALL template...
ru: Вставить шаблон FC C&ALL...
uk: Вставити шаблон FC C&ALL ...

source: Insert FB CA&LL template...
ru: Вставить шаблон FB CA&LL...
uk: Вставити шаблон FB CA&LL ...

source: &Standard library...
ru: &Стандартная библиотека...
uk: &Стандартна бібліотека...

source: &CPU
ru: &ЦП
uk: &ЦП

source: &Window
ru: &Окно
uk: &Вікно

source: &Help
ru: &Помощь
uk: &Допомога

source: Awlsim &homepage...
ru: Awlsim &домашняя страница...
uk: &Домашня сторінка Awlsim...

source: &About...
ru: &О программе...
uk: &Про застосунок...

source: Start profiling
ru: Начать профилирование
uk: Почати профілювання

source: Stop profiling
ru: Остановить профили
uk: Зупинити профілювання

source: &Close active window
ru: &Закрыть активное окно
uk: &Закрити активне вікно

source: Close &all except active
ru: Закрыть &все кроме активных
uk: Закрити &всі крім активного

source: Close a&ll
ru: Закрыть в&се
uk: Закрити в&сі

source: Unsaved AWL/STL code
ru: Несохраненный AWL/STL код
uk: Незбережений AWL/STL код

source: The editor contains unsaved AWL/STL code. AWL/STL code will be lost by exiting without saving.
ru: Редактор содержит несохраненный AWL/STL код. AWL/STL код будет потерян при выходе без сохранения.
uk: Редактор містить незбережений AWL/STL код. AWL/STL код буде втрачено при виході без збереження.

source: About Awlsim PLC
ru: О Awlsim PLC
uk: Про Awlsim PLC

source: Failed to start profiler.
ru: Не удалось запустить профилер.
uk: Не вдалося запустити профайлер.

source: GUI profiler dump:
ru: Дамп профиляра GUI:
uk: Дамп профайлеру GUI:

source: Failed to parse symbol table: {}
ru: Ошибка анализа таблицы символов: {}
uk: Не вдалося проаналізувати таблицю символів: {}

source: &Ok
ru: &Ок
uk: &Так

source: Available optimizers:
ru: Доступные оптимизаторы:
uk: Наявні оптимізатори:

source: Enter a custom optimizer here. A wrong name will cause a build error on the target CPU.
ru: Введите здесь пользовательский оптимизатор. Неправильное имя приведет к ошибке сборки на целевом ЦП.
uk: Введіть тут спеціальний оптимізатор. Неправильне ім’я призведе до помилки збірки в цільовому процесорі.

source: Enable the selected optimizer.
ru: Включить выбранный оптимизатор.
uk: Увімкнути обраний оптимізатор.

source: Disable the selected optimizer.
ru: Отключить выбранный оптимизатор.
uk: Вимкнути обраний оптимізатор.

source: Enabled optimizers:
ru: Включенные оптимизаторы:
uk: Увімкнені оптимізатори:

source: Enable &all available optimizers (recommended)
ru: Включить &все доступные оптимизаторы (рекомендуется)
uk: Увімкнути &усі наявні оптимізатори (рекомендовано)

source: If this box is ticked all available optimizers will be enabled. This is recommended.
ru: Если этот флажок отмечен, то будут включены все доступные оптимизаторы. Это рекомендуется.
uk: Якщо в цьому полі встановлено прапорець, то усі наявні оптимізатори буде увімкнено. Це рекомендовано.

source: &Run enabled optimizers (recommended)
ru: &Запустить включенные оптимизаторы (рекомендуется)
uk: &Запустити увімкнені оптимізатори (рекомендовано)

source: If this box is not ticked, none of the enabled optimizers will actually be executed.
ru: Если этот флажок не отмечен, то ни один из включенных оптимизаторов фактически не будет запущен.
uk: Якщо в це поле не встановлено прапорець, то не один із фактично увімкнених оптимізаторів не буде виконано.

source: WARNING: This optimizer is not known to Awlsim. It might cause a build error on the target CPU!
ru: ВНИМАНИЕ: Этот оптимизатор не известен Awlsim. Это может вызвать ошибку сборки на целевом ЦП!
uk: УВАГА: Цей оптимізатор не відомий Awlsim. Це може спричинити помилку збирання на цільовому процесорі!

source: AWL optimizer setup
ru: Настройка оптимизатора AWL
uk: Налаштування оптимізаторів AWL

source: Remove the selected source '{}' from the project? This can't be undone.
ru: Удалить выбранный исходник '{}' из проекта? Это не может быть отменено.
uk: Видалити обраний першокод '{}' з проекту? Це неможливо скасувати.

source: >>> New source <<<
ru: >>> Новый исходник <<<
uk: >>> Новий першокод <<<

source: Name for {} source
ru: Имя исходника {}
uk: Ім'я для {} першокоду

source: Failed to parse symbol table
ru: Не удалось проанализировать таблицу символов
uk: Не вдалося проаналізувати таблицю символів

source: Select symbol table
ru: Выберите таблицу символов
uk: Обрати таблицю символів

source: Please select the symbol table where to add the symbol to: {} "{}"
ru: Пожалуйста, выберите таблицу символов, где следует добавить символ: {} "{}"
uk: Виберіть таблицю символів, куди слід додати символ: {} "{}"

source: Failed to update symbol table
ru: Не удалось обновить таблицу символов
uk: Не вдалося оновити таблицю символів

source: Opened plain AWL/STL file
ru: Открыт обычный AWL/STL файл
uk: Відкрито звичайний файл AWL/STL

source: The plain AWL/STL source file '{}' has sucessfully been opened. If you click on 'save', you will be asked to create a project file for this source.
ru: Файл исходного кода AWL/STL '{}' успешно открыт. Если вы нажмете на 'Сохранить', вам будет предложено создать файл проекта для этого исходника.
uk: Звичайний файл першокоду AWL/STL '{} успішно відкрито. Якщо натиснути кнопку «Зберегти», вам буде запропоновано створити файл проекту для цього першокоду.

source: Create Awlsim project file?
ru: Создать файл проекта Awlsim?
uk: Створити файл проекту Awlsim?

source: The current project was created ad-hoc from a plain AWL/STL file. Can not save without creating a project file. Do you want to create a project file?
ru: Текущий проект был создан на основе обычного AWL/STL файла. Не могу сохранить без создания файла проекта. Вы хотите создать файл проекта?
uk: Поточний проект створено з звичайного AWL/STL файлу. Неможливо зберегти проект без створення файлу проекту. Ви хочете створити файл проекту?

source: Project contains external sources
ru: Проект содержит внешние исходники
uk: Проект містить не приєднаний першокод.

source: The project contains external sources. It is strongly recommended to integrate external sources into the project. Click on 'integrate source into project' in the source menu.
ru: Проект содержит внешние исходники. Настоятельно рекомендуется интегрировать в проект внешние исходники. Нажмите на 'интегрировать исходник в проект' в меню исходника.
uk: Проект містить не приєднаний першокод. Настійно рекомендується згуртувати зовнішній першокод із проектом. Натисніть на "Згуртувати в проект" у меню першокоду.

source: Save-file name changed. Re-generating project file UUIDs.
ru: Имя файла сохранения изменено. Повторное создание файла UUID проекта.
uk: Ім'я файлу змінено. Повторне генерування UUID файлів проекту.

source: CPU
ru: ЦП
uk: ЦП

source: Connection
ru: Соединение
uk: З'єднання

source: Editor settings
ru: Настройки редактора
uk: Параметри редактора

source: ERROR: There is an error in the source file. Please open it to fix the problem.
ru: ОШИБКА: Ошибка в исходном файле. Пожалуйста, откройте его, чтобы исправить проблему.
uk: ПОМИЛКА: У файлі першокоду є помилка. Необхідно відкрити його та усунути проблему.

source: WARNING: The source contained in the project does not match the source on the CPU. That means the CPU is currenly running an outdated program. Please re-download the sources to the CPU by clicking the download button in the tool bar.
ru: ВНИМАНИЕ: Исходник, содержащийся в проекте не соответствует исходному коду ЦП. Это означает, что процессор в настоящее время работает с устаревшей программой. Пожалуйста, перезагрузите исходные тексты в ЦП, нажав на кнопку загрузки в панели инструментов.
uk: УВАГА: Першокод, що міститься в проекті не відповідає першокоду у ЦП. Це означає, що ЦП працює із застарілою програмою. Перезавантажте першокод до ЦП натиснувши кнопку завантаження на панелі інструментів.

source: Source hash: {}...
ru: Хэш исходника: {}...
uk: Хеш першокоду: {}...

source: Right click here to add new AWL source.
ru: Щелкните правой кнопкой мыши здесь, чтобы добавить новый исходник AWL.
uk: Клацніть правою кнопкою миші тут, щоб додати новий першокод AWL.

source: Double click here to edit this AWL source.
ru: Дважды нажмите здесь, чтобы отредактировать этот исходник AWL.
uk: Двічі клацніть тут, щоб відредагувати цей першокод AWL.

source: Right click here to add new FUP source.
ru: Щелкните правой кнопкой мыши здесь, чтобы добавить новый исходник FUP.
uk: Клацніть правою кнопкою миші тут, щоб додати новий першокод FUP.

source: Double click here to edit this FUP diagram.
ru: Дважды нажмите здесь, чтобы изменить эту диаграмму FUP.
uk: Двічі клацніть тут, щоб відредагувати цей першокод FUP.

source: Right click here to add new KOP source.
ru: Щелкните правой кнопкой мыши здесь, чтобы добавить новый исходник KOP.
uk: Клацніть правою кнопкою миші тут, щоб додати новий першокод KOP.

source: Double click here to edit this KOP diagram.
ru: Дважды нажмите здесь, чтобы изменить эту диаграмму KOP.
uk: Двічі клацніть тут, щоб відредагувати цю діаграму KOP.

source: Right click here to add new symbol table.
ru: Нажмите правой кнопкой мыши здесь, чтобы добавить новую таблицу символов.
uk: Клацніть правою кнопкою миші тут, щоб додати нову таблицю символів.

source: Double click here to edit this symbol table.
ru: Дважды нажмите здесь, чтобы отредактировать таблицу символов.
uk: Двічі клацніть тут, щоб відредагувати цю таблицю символів.

source: Double click here to edit system library selections.
ru: Дважды нажмите здесь, чтобы изменить выбор системных библиотек.
uk: Двічі клацніть тут, щоб відредагувати вибір системних бібліотек.

source: Double click here to edit CPU settings.
ru: Дважды нажмите здесь, чтобы изменить настройки ЦП.
uk: Двічі клацніть тут, щоб відредагувати налаштування ЦП.

source: Double click here to edit core server connection settings.
ru: Дважды нажмите здесь, чтобы изменить настройки соединения с сервером.
uk: Двічі клацніть тут, щоб відредагувати налаштування з'єднання з сервером.

source: Double click here to edit hardware module settings.
ru: Дважды нажмите здесь, чтобы изменить настройки оборудования.
uk: Двічі клацніть тут, щоб відредагувати налаштування обладнання.

source: Double click here to edit GUI settings.
ru: Дважды нажмите здесь, чтобы изменить настройки GUI.
uk: Двічі клацніть тут, щоб відредагувати налаштування інтерфейсу.

source: (Copy)
ru: (Копия)
uk: (Скопіювати)

source: &Edit...
ru: &Изменить...
uk: &Правка...

source: &Add new {}
ru: &Добавить новый {}
uk: &Додати новий{}

source: &Delete...
ru: &Удалить...
uk: &Видалити...

source: &Rename...
ru: &Переименовать...
uk: &Перейменувати...

source: &Import...
ru: &Импорт...
uk: &Імпорт...

source: &Export...
ru: &Экспорт...
uk: &Експорт...

source: &Integrate '{}' into project...
ru: &Интегрировать '{}' в проект...
uk: &Згуртувати '{}' з проектом...

source: E&nable
ru: В&ключить
uk: У&вімкнути

source: D&isable
ru: В&ыключить
uk: В&имкнути

source: Integrate current {}
ru: Интегрировать текущий {}
uk: Згуртувати наступний {}
