Repository: mbuesch/awlsim
Catalog: awlsim/locales/*/LC_MESSAGES/*.po
Languages: ru, uk

source: The current {} is stored in an external file. Do you want to integrate this file info the awlsim project file (.awlpro)?
ru: Текущий {} хранится во внешнем файле. Вы хотите интегрировать этот файл в файл проекта awlsim (.awlpro)?
uk: Наступний {} збережено у зовнішньому файлі. Бажаєте згуртувати його з файлом проекту awlsim (.awlpro)?

source: AWL source
ru: AWL исходник
uk: AWL першокод

source: FUP source
ru: FUP исходник
uk: FUP першокод

source: KOP source
ru: KOP исходник
uk: KOP першокод

source: Symbol Table
ru: Символьная таблица
uk: Таблиця символів

source: Clipboard paste failed
ru: Не удалось вставить из буфера обмена
uk: Не вдалося вставити з буферу

source: The clipboard does not seem to contain data that can be pasted here.
ru: Буфер обмена не содержит данных, которые могут быть вставлены здесь.
uk: В буфері нема даних, які можливо сюди вставити.

source: awlsim-gui ERROR: {}
ru: awlsim-gui ОШИБКА: {}
uk: awlsim-gui ПОМИЛКА: {}

source: Press enter to exit.
ru: Нажмите Enter для выхода.
uk: Натисніть enter для виходу.

source: Deprecated QString API detected. Awlsim does not support PyQt QString v1 API. ---> Please use PySide2 or a newer PyQt5. <---
ru: Обнаружен устаревший QString API. Awlsim не поддерживает PyQt QString v1 API. ---> Пожалуйста, используйте PySide2 или более новый PyQt5. <---
uk: Виявлено застарілий API QString. Awlsim не підтримує API PyQt QString v1. ---> Будь ласка, використовуйте PySide2 або новіший PyQt5. <---

source: Failed to import PySide2 modules: {}
ru: Не удалось импортировать модули PySide2: {}
uk: Не вдалося імпортувати модулі PySide2: {}

source: Failed to import PyQt5 modules: {}
ru: Не удалось импортировать модули PyQt5: {}
uk: Не вдалося імпортувати модулі PyQt5: {}

source: Unknown GUI framework '{}' requested. Please fix the AWLSIM_GUI environment variable.
ru: Запрошен неизвестный GUI фреймворк '{}'. Исправьте переменную окружения AWLSIM_GUI.
uk: Невідомий фреймворк GUI '{}'. Будь ласка, виправте змінну середовища AWLSIM_GUI.

source: awlsim-gui version {}
ru: awlsim-gui версия {}
uk: awlsim-gui версія {}

source: Usage: awlsim-gui [OPTIONS] [PROJECT.awlpro]
ru: Использование: awlsim-gui [OPTIONS] [PROJECT.awlpro]
uk: Використання: awlsim-gui [ОПЦІЇ] [ПРОЕКТ.awlpro]

source: Options:
ru: Параметры:
uk: Опції:

source: -h|--help Print this help text
ru: -h|--help Печать этого текста справки
uk: -h|--help Надрукувати цей текст

source: -L|--loglevel LVL Set the log level:
ru: -L|--loglevel LVL Установить уровень журнала:
uk: -L|--loglevel LVL Встановити рівень логування:

source: 0: Log nothing
ru: 0: Нет журнала
uk: 0: Без логування

source: 1: Log errors
ru: 1: Записывать ошибки
uk: 1: Лог помилок

source: 2: Log errors and warnings
ru: 2: Записывать ошибки и предупреждения
uk: 2: Лог помилок та попереджень

source: 3: Log errors, warnings and info messages (default)
ru: 3: Записывать ошибки, предупреждения и информационные сообщения (по умолчанию)
uk: 3: Лог помилок, попереджень та інформації (як усталено

source: 4: Verbose logging
ru: 4: Подробный журнал
uk: 4: Детальний лог

source: 5: Extremely verbose logging
ru: 5: Чрезвычайно подробное ведение журнала
uk: 5: Максимально детальний лог

source: -l|--lang Set locale
ru: -l|--lang Установить язык
uk: -l|--lang Встановити мову

source: Environment variables:
ru: Переменные окружения:
uk: Змінні середовища:

source: AWLSIM_GUI Select the GUI framework (default 'auto')
ru: AWLSIM_GUI Выбрать графический интерфейс (по умолчанию 'auto')
uk: AWLSIM_GUI Вибрати GUI фреймворк (усталено 'auto')

source: Can be either of:
ru: Может быть любым из:
uk: Один із:

source: auto: Autodetect
ru: auto: Автоопределение
uk: auto: Автоматичне визначення

source: pyside: Use PySide 4
ru: pyside: Использовать PySide 4
uk: pyside: Використовувати PySide 4

source: pyqt4: Use PyQt 4
ru: pyqt4: Использовать PyQt 4
uk: pyqt4: Використовувати PyQt 4

source: pyqt5: Use PyQt 5
ru: pyqt5: Использовать PyQt 5
uk: pyqt5: Використовувати PyQt 5

source: -L|--loglevel: Invalid log level
ru: -L|--loglevel: Недопустимый уровень журнала
uk: -L|--loglevel: Неправильний рівень логування

source: Using {} GUI framework
ru: Использование {} GUI фреймворка
uk: Використання фреймфорка {} GUI

source: awlsim-gui: ABORTING due to unhandled exception:
ru: awlsim-gui: ОШИБКА из-за необработанного исключения:
uk: awlsim-gui: ЗУПИНКА через необроблену помилку:

source: awlsim-gui: Unhandled exception
ru: awlsim-gui: Необработанное исключение
uk: awlsim-gui: Необроблена помилка

source: Unnamed symbol table
ru: Таблица символов без названия
uk: Безіменна таблиця символів

source: The symbol name. (The name is case insensitive.)
ru: Имя символа. (Имя не чувствительно к регистру.)
uk: Назва символу (Назва не вразлива до регістру.)

source: The symbol address. For example: M 0.0 or QW 0
ru: Адрес символа. Например: M 0.0 или QW 0
uk: Адреса символу. Наприклад: M 0.0 або QW 0

source: The symbol data type. For example: BOOL or INT
ru: Тип данных символа. Например: BOOL или INT
uk: Тип даних символу. Наприклад: BOOL або INT

source: Symbol
ru: Символ
uk: Символ

source: Address
ru: Адрес
uk: Адреса

source: Invalid symbol information
ru: Недопустимая информация о символе
uk: Неправильна інформація про символ

source: Could not parse symbol table information
ru: Не удалось проанализировать информацию о таблице символов
uk: Не вдалося проаналізувати інформацію таблиці символів

source: Awlsim - Insert {} template
ru: Awlsim - Вставить шаблон {}
uk: Awlsim - Вставити {} зразок

source: Insert {} template
ru: Вставить {} шаблон
uk: Вставити {} зразок

source: {} number:
ru: {} номер:
uk: {} номер:

source: Generate &verbose code
ru: Генерировать &подробный код
uk: Створювати &розширений код

source: &Paste code
ru: &Вставить код
uk: &Вставити код

source: Go offline
ru: Отключиться
uk: Роз'єднатися

source: Go online (Connect to a CPU)
ru: Подключиться (к ЦП)
uk: З'єднатися (з ЦП)

source: Stop CPU (STOP mode)
ru: Остановить ЦП (режим СТОП)
uk: Зупинити ЦП (режим СТОП)

source: Start CPU (RUN mode)
ru: Запустить ЦП (режим РАБОТА)
uk: Запустити ЦП (режим ДІЯ)

source: Disable online diagnosis
ru: Отключить диагностику онлайн
uk: Вимкнути поточну діагностику

source: Enable online diagnosis
ru: Включить диагностику онлайн
uk: Увімкнути поточну діагностику

source: CPU inspection tool bar
ru: Панель проверки ЦП
uk: Панель інструментів огляду ЦП

source: Add inspection: Online blocks
ru: Добавить обзор: онлайн-блоки
uk: Додати огляд: Під'єднані блоки

source: Add inspection: Input memory (I / E)
ru: Добавить обзор: Память ввода (I / E)
uk: Додати огляд: Пам'ять входів (I / E)

source: Add inspection: Output memory (Q / A)
ru: Добавить обзор: Память вывода (Q / A)
uk: Додати огляд: Пам'ять виходів (Q / A)

source: Add inspection: Flag memory (M)
ru: Добавить обзор: Память флагов (M)
uk: Додати огляд: Пам'ять сигналів (M)

source: Add inspection: Data block (DB)
ru: Добавить обзор: Блок данных (DB)
uk: Додати огляд: Блок даних (DB)

source: Add inspection: Timer (T)
ru: Добавить обзор: Таймер (Т)
uk: Додати огляд: Таймер (T)

source: Add inspection: Counter (C / Z)
ru: Добавить обзор: Счетчик (C / Z)
uk: Додати огляд: Лічильник (C / Z)

source: Add inspection: CPU overview
ru: Добавить обзор: ЦП
uk: Додати огляд: ЦП

source: Add inspection: LCD
ru: Добавить обзор: LCD
uk: Додати огляд: LCD

source: CPU control tool bar
ru: Панель управления ЦП
uk: Контрольна панель ЦП

source: Reset the CPU
ru: Сброс ЦП
uk: Перезавантажити ЦП

source: Download all sources to CPU
ru: Загрузить все исходные коды в ЦП
uk: Завантажити усі першокоди до ЦП

source: Download single source to CPU
ru: Загрузить отдельный исходник в ЦП
uk: Завантажити окремий першокод до ЦП

source: Running awlsim-gui on the PyPy or Jython interpreter is not supported.
ru: Запуск awlsim-gui на PyPy или Jython интерпретаторе не поддерживается.
uk: Запуск awlsim-gui на PyPy чи Jython інтерпретаторі не підтримується.

source: Please use CPython 2.7 or CPython 3.x
ru: Используйте CPython 2.7 или CPython 3.x
uk: Використовуйте CPython 2.7 чи CPython 3.x

source: *** Using accelerated CYTHON core (AWLSIM_CYTHON environment variable is set)
ru: *** Используется ускоренное ядро CYTHON (переменная окружения AWLSIM_CYTHON установлена)
uk: *** Використання прискореного CYTHON ядра (AWLSIM_CYTHON змінна середовища встановлена)

source: Fatal exception:
ru: Неустранимая ошибка:
uk: Фатальна помилка:

source: A fatal exception occurred
ru: Произошла критическая ошибка
uk: Сталася фатальна помилка

source: <pre>A fatal exception occurred: {} Awlsim will be terminated.</pre>
ru: <pre>Произошла критическая ошибка: {} Awlsim будет завершен.</pre>
uk: <pre>Сталася фатальна помилка: {} Awlsim буде закрито.</pre>

source: Show verbose information
ru: Показать подробную информацию
uk: Показати детальну інформацію

source: C&ontinue
ru: П&родолжить
uk: П&родовжити

source: An exception occurred:
ru: Произошла критическая ошибка:
uk: Сталася помилка:

source: Requesting asynchronous validation (delay = {:.1f} s)
ru: Запрос асинхронной проверки (задержка = {:.1f} с)
uk: Запит асинхронної перевірки (затримка = {:.1f} с)

source: Starting asynchronous validation.
ru: Запуск асинхронной проверки.
uk: Початок асинхронної перевірки.

source: Not Ok
ru: Не ОК
uk: Не Добре

source: Ok
ru: Ок
uk: Добре

source: Finished asynchronous validation: {}
ru: Завершена асинхронная проверка {}
uk: Закінчено асинхронну перевірку: {}

source: Synchronous validation timeout.
ru: Время синхронной проверки истекло.
uk: Вийшов час синхронної перевірки.

source: Finished synchronous validation: {}
ru: Завершена синхронная проверка: {}
uk: Закінчено синхронну перевірку: {}

source: Accu 1
uk: Ак. 1

source: Accu 2
uk: Ак. 2

source: Accu 3
uk: Ак. 3

source: Accu 4
uk: Ак. 4
